# day 12

1.Pivot Table
2.pandas concat
3.pandas merge
4.pandas join

In [8]:
import pandas as pd 
import numpy as np

In [9]:
data = {'country':['india','japan','china','USA'],
        'year':['2010','2012','2012','2012'],
        'continent':['asia','NA','asia','NA'],
        'value':[20,10,40,50]
       }

In [11]:
df=pd.DataFrame(data)

In [12]:
df

  country  year continent  value
0   india  2010      asia     20
1   japan  2012        NA     10
2   china  2012      asia     40
3     USA  2012        NA     50

In [13]:
pd.pivot_table(df,index=['year'],aggfunc='sum')

      value
year
2010     20
2012    100

In [14]:
pd.pivot_table(df,index=['continent'],aggfunc='sum')

           value
continent
NA            60
asia          60

# concat

In [16]:
people1= {'id':[1,2,3,4],
         'name':['ae','dd','ed','ee'],
         'age':[12,33,44,55]
         }

people2= {'id':[11,22,33,44],
         'name':['wwe','edd','ffed','hjee'],
         'age':[32,63,47,85]
         }
people3= {'id':[441,552,763,774],
         'name':['aris','adil','edee','ge'],
         'age':[17,63,54,25]
         }

In [17]:
df1=pd.DataFrame(people1)
df2=pd.DataFrame(people2)
df3=pd.DataFrame(people3)

In [18]:
df1

   id name  age
0   1   ae   12
1   2   dd   33
2   3   ed   44
3   4   ee   55

In [19]:
pd.concat([df1,df2,df3],ignore_index=True)

     id  name  age
0     1    ae   12
1     2    dd   33
2     3    ed   44
3     4    ee   55
4    11   wwe   32
5    22   edd   63
6    33  ffed   47
7    44  hjee   85
8   441  aris   17
9   552  adil   63
10  763  edee   54
11  774    ge   25

In [35]:
people4= {'id':[1,2,3,4],
         'name':['ae','dd','ed','ee'],
         'age':[12,33,44,55]
         }

people5= {'id':[1,2,3,4],
         'name':['ae','dd','ed','ee'],
         'age':[12,33,44,55]
         }

In [36]:
df4=pd.DataFrame(people4)
df5=pd.DataFrame(people5)

In [37]:
df4

   id name  age
0   1   ae   12
1   2   dd   33
2   3   ed   44
3   4   ee   55

In [38]:
pd.merge(df4,df5,on=['id','name'])

   id name  age_x  age_y
0   1   ae     12     12
1   2   dd     33     33
2   3   ed     44     44
3   4   ee     55     55

In [39]:
people6= {'id':[1,2,3,4],
         'name':['ae','dd','ed','ee'],
         'age':[12,33,44,55]
         }

people7= {
         's_name':['aee','drd','ehhd','erre'],
         'ph':[13442,5533,466664,576655]
         }

In [44]:
df6=pd.DataFrame(people6)
df7=pd.DataFrame(people7)

In [45]:
df6.join(df7)

   id name  age s_name      ph
0   1   ae   12    aee   13442
1   2   dd   33    drd    5533
2   3   ed   44   ehhd  466664
3   4   ee   55   erre  576655

In [48]:
d1 = pd.read_csv('myfile.csv',sep='\t')
d1

   name,age,roll
0  'gulnaz'18,84
1  'sahiba'11,23
2    'gdye'22,45

In [55]:
d2=pd.read_csv('my semi.txt'csv.txt,sep=';')

SyntaxError: invalid syntax (2193134392.py, line 1)

In [56]:
df6

   id name  age
0   1   ae   12
1   2   dd   33
2   3   ed   44
3   4   ee   55

In [58]:
df6.to_json('myjson.json')

In [60]:
d4=pd.read_json('myjson.json')
d4

   id name  age
0   1   ae   12
1   2   dd   33
2   3   ed   44
3   4   ee   55

df5

In [61]:
df5

   id name  age
0   1   ae   12
1   2   dd   33
2   3   ed   44
3   4   ee   55

In [63]:
df5.to_csv('mycsvv.csv')